<?php	
	public function actionIndex() {
		
	}
	
	public function getTag() {
		
		
	}
	
	private $string = '美国著名摄影家安塞尔·亚当斯的区域曝光理论，是半个多世纪以来摄影科学的基本理论之一。亚当斯在他所写的《负片与照片》一书中对此曾作了详尽的表述。他所介绍的方法虽然较为复杂，然而是极其有用的。有人曾指出，一旦掌握了这种方法，甚至是初学摄影者也能像经验丰富的老手一样，在按下快门之前就能预料到最终得到的照片是什么模样。只要掌握了这种方法，摄影者就会学会分析景物，对景物进行更为准确的测光，并根据测光的结果作出适当的曝光，从而把对景物的视觉印象忠实地或者创造性地再现在照片上。
		根据亚当斯的理论，黑白照片的色调或灰调可以分为十个“区域”，由零区域（相纸能够表现出的最黑的部分）至第十区域（相纸的底色——白色）。第五区域是中等的灰度，它可以根据测光表的读数曝光而得出来；第三区域是有细节的明影部分，而第八区域则是有细节的强光部分。
　　凭着区域系统，摄影者便可以预见到照片的最后影像，并使底片能够根据摄影者心目中的构思去曝光。一个简单的例子，就是量度阴影部分的光量，为使这部分能够有更多细节，并将光圈增大两级；然后量度重要强光部分的光量，按照区域系统理论，强光部分比阴影部分亮了五级，如果明影部分是第三区域的话，强光部分便是第八区域。倘若这是摄影者的构思，便可以马上进行拍摄。要是想使强光部分有更多层次，摄影者可以缩短底片的显影时间来减低反差，使第八区域变为第七区域。相反地，如果想使重要阴影部分有更多层次，而这部分又比较明亮部分暗了三级，显影时便可增加时间以增大照片的对比度，从而使强光部分变得更亮。 当然，在充分掌握曝光区域理论之前，必须进行一些曝光和显影的试验，有关的内容较为繁琐，不再赘述。
　　下面介绍亚当斯的一幅作品及其拍摄经过，以便对他的这种区域曝光法能有所了解。
　　《冬天的风暴》是亚当斯1940年拍摄于约塞米蒂国家公园的一幅作品。那是12月初的一天。风暴最初夹杂着大雨，后来雨又变成了雪，直到中午天气才开始变得清澈。亚当斯驱车来到一个新找到的能够激起创作灵感的拍摄点，站在这里能看到约塞米蒂峡谷迷人的景色。他立即架起了8×10相机，装上121/4英寸的柯达XV镜头，对山坡和画面底部进行了取舍构图。然后等待云彩在画面上部形成动人的形状。为了避免云彩移动时造成影像模糊，曝光时间要求很短。
　　对于这种景物，如果是用普通的平均读数曝光，按正常显影，底片的反差会很低。云彩是灰色的，阳光照射的明亮部分显得苍白，而阴影部分则非常柔和，亚当斯运用了区域曝光法，在拍摄之前他己能预见到最后的照片是外么样子。于是他对一系列区域进行了测光。当时点式测光表还未问世。
　　亚当斯回忆道： “我在测光表正面加一节管子，把它的视角减少到大约15。左右，当然，我需要用4去乘侧光表所测得的任何部位的亮度值。在这一景色中，我可以断定表现出质惑的最明亮部分的亮度为160烛光／平方英尺，把这一亮度置于七区。我发现，右边最暗的树所具有的亮度(测光结果是3烛光／平方英尺)落在一区。由于树林挂有一层薄雪，它的平均亮度落在二区和三区。除了呈箭头状的明亮瀑布之外，最明亮的部分要算是云彩了。我估计瀑布的亮度大约有500烛光／平方英尺。为了提高树木的亮度，
　　我本来可以使曝光增大2倍到4倍，但是这样可能会失去我认为照片会表现出来的某种透明的光亮感。鉴于对底片进行的这种最低的曝光，显影是要比正常区域提高一区。这就使得(本来位于七区的)高亮度达到八区的亮度标准，并且各种明暗层次会普遍显得明快。”
　　冲印出的底片保留了亚当斯所要反映的信息，经过在暗室中进行的某种程度的遮挡和加光，得到了一张十分生动的照片。这就是当时在他眼前的景色的忠实再现。
　　亚当斯在总结他运用区域曝光法的拍摄实践时说过：“我发现，如果我小心遵照区域系统所提供的各种精确性，对预想的影像进行积极的想象，我拍出的效果几乎总是令人满意的，至少从技术上讲是这样。但是，简单的计算错误造成的后果可能是严重的，例如，忘记把镜头接圈或滤光镜因数考虑进去。
　　应当记住，万一在错综复杂的情况下拍摄失败，每张照片的曝光记录，其中应当包括曝光细节以及显影指示，都可以作为诊断时的参考。”
　　附：安塞尔·亚当斯
　　安塞尔·亚当斯1902年生于美国西海岸的旧金山。少年时代学习音乐，立志作钢琴家，由于用功过度，健康受到损害，才到约塞密提的舅父家去疗养。他的舅父是开照相馆的，这是他从14岁起，就开始以摄影手段表现约塞密提的风景，并奠定了他一生在摄影事业上作出卓越贡献的基础。在那以后，在漫长的摄影生涯中，他始终对约塞密提怀有特殊的感情，每年都要专门来这里拍照。亚当斯之于约塞密提大有“百看不厌，百拍不烦”的感情。
　　亚当斯摄影艺术的成就，受到他的前辈摄影家史丹特和纯摄影派代表人物斯蒂格里茨的巨大影响。他初期就学于威士顿门下，而后与威士顿成为密友。1932年受威士顿思想作风的影响，以“F/64”为名，组成一个摄影团体。“F64”是当时照相机上最小一级光圈，这个组织的定名就是他们艺术主张的宣言。就是说，他们主张用很小的光圈，获得较长的景深和极好的清晰度。因此亚当斯属于“纯摄影派”的显要人物。他的作品都不愧列入纯摄影派典型，最优秀的代表作之列。
　　亚当斯用“纯粹”的摄影艺术去表现真实美丽的世界，唤起摄影家对纯粹摄影艺术表现特性和伟大潜力的注意。亚当斯认为，摄影家正如其它艺术家一样，选择自己有独到性的事物和领域，去表现世界和自己。他正是这样规范自己的创造活动的。在他六十多年摄影创作活动中，一直以风景摄影作品驰名环宇。可以说亚当斯的每一幅作品都有自己的风格和特点。他的风景照片有一个很大的特点，就是画面上没有人物，与社会、历史不发生联系，也没有新闻要素，但是他的作品所表现的美感，是超乎人的一般感受的。他从青年时代就迷恋着的约塞密提，这里的风景是他创作的不竭的源泉。更有趣的是亚当斯拍摄的富有诗意的约塞密提的风景摄影作品，不仅使这里吸引了千百万游人，使亚当斯获得有“约塞密提大师”的声誉，而且使得美国国会在1916年通过了国家公园法，开辟约塞密提为国家公园。摄影艺术居然发挥了如此显著的社会功用是亚当斯预料所不及并引以为荣的。
　　几十年里，亚当斯背着沉重的摄影器材，翻越在加利福尼亚东部的金斯峡谷区，把大自然表现得特别深刻而有气魄。他倡导的“区域曝光法”也是为了使作品获得最好的素质，从而表达出风光的美感。亚当斯还是一位摄影著作家和摄影教育家，从1960年到1979年的二十年里，出版了十五部著作。1943年他进入纽约艺术博物馆，任摄影部主任。1946年回到他的故乡旧金山，在州立美术学院教授摄影艺术。亚当斯一直到八十岁高龄仍然不懈地著述和创作，他的艺术叹为观止。1984年二月，这位摄影老人与世长辞。';
}
class ToolController extends Controller {
	
